[
  {
    "company": "The.com",
    "logo": "images/the.com.png",
    "location": "Remote",
    "title": "Software Engineer",
    "dates": "Jan. 2021–Present",
    "duties": [
      "Improved memory management by 50% and oversaw other key performance optimizations",
      "Led automation feature development, opening product line to enterprise customers",
      "Utilized Google Cloud Platform for data storage and endpoint management in a serverless architecture",
      "Orchestrated regular deployments to staging and production environments",
      "Frequently wrote internal documentation, tests, and updates to CI/CD pipelines and build tools"
    ]
  },
  {
    "company": "SquadFormers",
    "logo": "images/squadformers.png",
    "location": "Remote",
    "title": "Software Engineer (Contract)",
    "dates": "July 2021–Nov. 2021",
    "duties": [
      "Built desktop application features with React and Go, making use of websockets for real time communication",
      "Contributed to product and architecture discussions as the client's userbase and team grew",
      "Led feature development in product's agile development cycle"
    ]
  },
  {
    "company": "coUrbanize",
    "logo": "images/courbanize.png",
    "location": "Boston, MA",
    "title": "Senior Software Engineer",
    "dates": "Feb., 2020–Aug. 2020",
    "duties": [
      "Led the MVP develop for the company's core second product from inception",
      "Architected application infrastructure hosted on AWS using key services including Elastic Beanstalk, SNS, RDS, and Lambda",
      "Instituted CI/CD tooling using GitHub Actions for regular deployments",
      "Utilized GraphQL API layer for multi-client API consumption"
    ]
  },
  {
    "company": "SyncOnSet Technologies",
    "logo": "images/sos.svg",
    "location": "Boston, MA",
    "title": "Software Engineer",
    "dates": "Apr., 2018–Feb., 2020",
    "duties": [
      "Mentored junior engineers in building and maintaining company's Angular application",
      "Contributed software engineering expertise in the development of the company's key product",
      "Introduced methodologies and best practices for scalable building and collaboration across a rapidly expanded team",
      "Rebuilt core application as a single-page application using including Node.js, React, MySQL, and TypeScript"
    ]
  },
  {
    "company": "Swell Rewards",
    "logo": "images/swell.jpg",
    "location": "Boston, MA",
    "title": "Front-end Developer",
    "dates": "July, 2017–Mar., 2018",
    "duties": [
      "Developed web components for integrating with third-party e-commerce sites, emphasizing performance, cross-browser compatibility, SEO, and best practices",
      "Created a new development process enabling the product to make use of modern front-end tools such as React and Webpack",
      "Established a centralized code repository to aid in version control reusable code snippets and collaboration with other developers"
    ]
  },
  {
    "company": "Boston University Metropolitan College",
    "logo": "images/bu.gif",
    "location": "Boston, MA",
    "title": "Web Producer",
    "dates": "Oct. 2015–July, 2017",
    "duties": [
      "Managed team of engineers across distributed projects",
      "Maintained legacy .NET applications and oversaw the migration to custom in-house WordPress instances",
      "Improved page rank score by 90% for department-managed degree programs",
      "Chartered data analytics to provide feedback for UI/UX and user engagement",
      "Created and tracked email marketing campaigns thousands 1000s of recipients"
    ]
  }
]
